---
kind: type
id: T:Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption
source: html/aee63133-70ad-7902-c3b5-1f162151679b.htm
---
# Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption

The option determines the slop of the sketched run/landing.

## Syntax (C#)
```csharp
public enum SketchedCurveSlopeOption
```